data_generation/simulation_results/case_32/constant/simParams
nIter 2000;
hComponent0 1097.7699799172049;
hComponent1 4448.996591260333;
hComponent2 4593.28775206164;
hComponent3 3693.5184156544897;
hComponent4 4694.938447069438;kComponent0 34.64946547995224;
kComponent1 21.48834036873461;
kComponent2 22.21180325399593;
kComponent3 43.535631463847515;
kComponent4 70.95497332888324;
tAmbient 300;
Ux 0.5185546074161664;
kPCB 0.9410175584446968;